*** c#
#+BEGIN_SRC csharp :tangle no
 class HelloWorld {
  public static void Main()
  {
    System.Console.WriteLine("Hello World!");
  }
}
#+END_SRC

#+RESULTS:
: Hello World!

*** C++
#+BEGIN_SRC cpp :tangle no
  #include <iostream>

int main() {
    std::cout << "Hello World!";
    return 0;
}
#+END_SRC

#+RESULTS:
: Hello World!

*** css
#+BEGIN_SRC css :tangle no
  :root {
    --main-fg-color: white;
  }

  body {
    color: var(--main-fg-color);
  }
#+END_SRC

#+RESULTS:
: :root {
:   --main-fg-color: white;
: }
:
: body {
:   color: var(--main-fg-color);
: }

*** dart
#+BEGIN_SRC dart :results output :tangle no
  var status = true;
  if (status) {
    print ('Status was true');
  } else {
    print('Status was false');
  }

  var test = "hello" + " there";
  print (test == "hello there");
  print (test == "not hello there");
#+END_SRC

#+RESULTS:
: Status was true
: true
: false

*** go
#+BEGIN_SRC go :results drawer :imports "fmt" :tangle no
 fmt.Println("Hello World!")
#+END_SRC

#+RESULTS:
:results:
Hello World!
:end:
*** graphql
#+BEGIN_SRC graphql :url https://countries.trevorblades.com/ :tangle no
  query GetContinents {
      continent(code: "AF") {
          name
	  code
      }
  }
#+END_SRC

#+RESULTS:
: {
:   "data": {
:     "continent": {
:       "name": "Africa",
:       "code": "AF"
:     }
:   }
: }

#+BEGIN_SRC elisp :tangle no
#+END_SRC
*** haskell
#+BEGIN_SRC haskell :tangle no
  :{
  chain :: (Integral a) => a -> [a]
  chain 1 = [1]
  chain n
      | even n = n:chain (n `div` 2)
      | odd n  = n:chain (n*3 + 1)
  :}
  chain 10
#+END_SRC

#+RESULTS:
| 10 | 5 | 16 | 8 | 4 | 2 | 1 |
*** http
#+BEGIN_SRC http :pretty :tangle no
GET https://api.github.com/repos/zweifisch/ob-http/languages
Accept: application/vnd.github.moondragon+json
#+END_SRC

#+RESULTS:
: {
:   "Emacs Lisp": 15327,
:   "Shell": 139
: }

*** java
#+HEADERS: :classname HelloWorld
#+BEGIN_SRC java  :results output :exports both :tangle no
  public class HelloWorld {
      public static void main(String[] args) {
          System.out.println("Hello, World");
      }
  }
#+END_SRC

#+RESULTS:
: Hello, World
*** js
#+BEGIN_SRC js :results output :tangle no
message = 'Hello, World!';
let arr = [1, 2];
let [x, y] = arr;

console.log(message);
console.log(x);
console.log(y);
#+END_SRC

#+RESULTS:
: Hello, World!
: 1
: 2

*** kotlin
#+BEGIN_SRC kotlin :tangle no
fun fib(n: Int):Int {
    return when (n) {
           0,1 -> 1
           else -> fib(n - 1) + fib(n - 2)
    }
}

fib(19)
#+END_SRC

#+RESULTS:
: res0: kotlin.Int = 6765
: res1: kotlin.String = >>>

*** latex
#+BEGIN_SRC latex :tangle no
\LaTeX
#+END_SRC

#+RESULTS:
#+begin_export latex
\LaTeX
#+end_export
*** python
https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html
#+BEGIN_SRC python :results output :tangle no
  print('Hello world!')
#+END_SRC

#+RESULTS:
: Hello world!

*** restclient
#+BEGIN_SRC restclient :tangle no
  GET http://example.com
#+END_SRC

#+RESULTS:
#+begin_example html
,#+BEGIN_SRC html
<!doctype html>
<html>
<head>
    <title>Example Domain</title>

    <meta charset="utf-8" />
    <meta http-equiv="Content-type" content="text/html; charset=utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <style type="text/css">
    body {
        background-color: #f0f0f2;
        margin: 0;
        padding: 0;
        font-family: -apple-system, system-ui, BlinkMacSystemFont, "Segoe UI", "Open Sans", "Helvetica Neue", Helvetica, Arial, sans-serif;

    }
    div {
        width: 600px;
        margin: 5em auto;
        padding: 2em;
        background-color: #fdfdff;
        border-radius: 0.5em;
        box-shadow: 2px 3px 7px 2px rgba(0,0,0,0.02);
    }
    a:link, a:visited {
        color: #38488f;
        text-decoration: none;
    }
    @media (max-width: 700px) {
        div {
            margin: 0 auto;
            width: auto;
        }
    }
    </style>
</head>

<body>
<div>
    <h1>Example Domain</h1>
    <p>This domain is for use in illustrative examples in documents. You may use this
    domain in literature without prior coordination or asking for permission.</p>
    <p><a href="https://www.iana.org/domains/example">More information...</a></p>
</div>
</body>
</html>

<!-- GET http://example.com -->
<!-- HTTP/1.1 200 OK -->
<!-- Accept-Ranges: bytes -->
<!-- Age: 453510 -->
<!-- Cache-Control: max-age=604800 -->
<!-- Content-Type: text/html; charset=UTF-8 -->
<!-- Date: Sat, 16 Oct 2021 21:01:17 GMT -->
<!-- Etag: "3147526947" -->
<!-- Expires: Sat, 23 Oct 2021 21:01:17 GMT -->
<!-- Last-Modified: Thu, 17 Oct 2019 07:18:26 GMT -->
<!-- Server: ECS (dcb/7EA7) -->
<!-- Vary: Accept-Encoding -->
<!-- X-Cache: HIT -->
<!-- Content-Length: 648 -->
<!-- Request duration: 0.272552s -->
,#+END_SRC
#+end_example

*** rust
#+BEGIN_SRC rust :results output :tangle no
  fn main() {
      let greetings = ["Hello", "Hola", "Bonjour",
                       "Ciao", "こんにちは", "안녕하세요",
                       "Cześć", "Olá", "Здравствуйте",
                       "chào bạn", "您好"];

      for (num, greeting) in greetings.iter().enumerate() {
          print!("{} : ", greeting);
          match num {
              0 =>  println!("This code is editable and runnable!"),
              1 =>  println!("Este código es editable y ejecutable!"),
              2 =>  println!("Ce code est modifiable et exécutable!"),
              3 =>  println!("Questo codice è modificabile ed eseguibile!"),
              4 =>  println!("このコードは編集して実行出来ます！"),
              5 =>  println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
              6 =>  println!("Ten kod można edytować oraz uruchomić!"),
              7 =>  println!("Esse código é editável e executável!"),
              8 =>  println!("Этот код можно отредактировать и запустить!"),
              9 =>  println!("Bạn có thể edit và run code trực tiếp!"),
              10 =>  println!("这段代码是可以编辑并且能够运行的！"),
              _ =>  {},
          }
      }
  }
#+END_SRC

#+RESULTS:
#+begin_example
Hello : This code is editable and runnable!
Hola : Este código es editable y ejecutable!
Bonjour : Ce code est modifiable et exécutable!
Ciao : Questo codice è modificabile ed eseguibile!
こんにちは : このコードは編集して実行出来ます！
안녕하세요 : 여기에서 코드를 수정하고 실행할 수 있습니다!
Cześć : Ten kod można edytować oraz uruchomić!
Olá : Esse código é editável e executável!
Здравствуйте : Этот код можно отредактировать и запустить!
chào bạn : Bạn có thể edit và run code trực tiếp!
您好 : 这段代码是可以编辑并且能够运行的！
#+end_example
*** rustic
#+BEGIN_SRC rustic :results output :tangle no
fn main() {
    let greetings = ["Hello", "Hola", "Bonjour",
                     "Ciao", "こんにちは", "안녕하세요",
                     "Cześć", "Olá", "Здравствуйте",
                     "chào bạn", "您好"];

    for (num, greeting) in greetings.iter().enumerate() {
        print!("{} : ", greeting);
        match num {
            0 =>  println!("This code is editable and runnable!"),
            1 =>  println!("Este código es editable y ejecutable!"),
            2 =>  println!("Ce code est modifiable et exécutable!"),
            3 =>  println!("Questo codice è modificabile ed eseguibile!"),
            4 =>  println!("このコードは編集して実行出来ます！"),
            5 =>  println!("여기에서 코드를 수정하고 실행할 수 있습니다!"),
            6 =>  println!("Ten kod można edytować oraz uruchomić!"),
            7 =>  println!("Esse código é editável e executável!"),
            8 =>  println!("Этот код можно отредактировать и запустить!"),
            9 =>  println!("Bạn có thể edit và run code trực tiếp!"),
            10 =>  println!("这段代码是可以编辑并且能够运行的！"),
            _ =>  {},
        }
    }
}
#+END_SRC

#+RESULTS:
#+begin_example
Hello : This code is editable and runnable!
Hola : Este código es editable y ejecutable!
Bonjour : Ce code est modifiable et exécutable!
Ciao : Questo codice è modificabile ed eseguibile!
こんにちは : このコードは編集して実行出来ます！
안녕하세요 : 여기에서 코드를 수정하고 실행할 수 있습니다!
Cześć : Ten kod można edytować oraz uruchomić!
Olá : Esse código é editável e executável!
Здравствуйте : Этот код можно отредактировать и запустить!
chào bạn : Bạn có thể edit và run code trực tiếp!
您好 : 这段代码是可以编辑并且能够运行的！
#+end_example
*** sass
#+BEGIN_SRC scss :tangle no
$primary-color: #333;

body {
  color: $primary-color;
}
#+END_SRC

#+RESULTS:
: body {
:   color: #333;
: }
:
: /*# sourceMappingURL=sass-out-i7KbbA.map */

*** shell
#+BEGIN_SRC shell :results drawer :tangle no
 echo $0
#+END_SRC

#+RESULTS:
:results:
/run/current-system/sw/bin/zsh
:end:
*** swift
#+BEGIN_SRC swift :tangle no
print("Hello, World!")
#+END_SRC

#+RESULTS:
: zsh:1: command not found: swift
*** translate
#+BEGIN_SRC translate :src auto :dest de,fr,ar,ja :tangle no
This a test.
#+END_SRC

#+RESULTS:
| de | Dies ist ein Test. |
| fr | C'est un test.     |
| ar | هذا اختبار.       |
| ja | これはテストです。 |
*** typescript
#+BEGIN_SRC typescript :tangle no
let message: string = 'Hello, World!';
console.log(message);
#+END_SRC

#+RESULTS:
: Hello, World!
